In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
rds_connection_string = "postgres:postgres@localhost:5432/SuperUberDuberProject"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [3]:
engine.table_names()

['store_directory', 'happiness']

In [9]:
happiness_df = pd.read_sql_query('select * from happiness', con=engine).head()
happiness_df.head()

       country  happiness_rank  gdp_per_capita   freedom
0       Norway               1        1.616463  0.635423
1      Denmark               2        1.482383  0.626007
2      Iceland               3        1.480633  0.627163
3  Switzerland               4        1.564980  0.620071
4      Finland               5        1.443572  0.617951

In [10]:
store_directory_df = pd.read_sql_query('select * from store_directory', con=engine).head()
store_directory_df.head()

   amount_of_stores               Country
0                 1               Andorra
1               144  United Arab Emirates
2               108             Argentina
3                18               Austria
4                22             Australia

In [29]:
merged_df = store_directory_df.merge(happiness_df, left_on='Country', right_on='country')
len(merged_df)

0

In [24]:
mergedFUN= store_directory_df.merge(happiness_df, left_on='Country', right_on='country')
mergedFUN

Empty DataFrame
Columns: [amount_of_stores, Country, country, happiness_rank, gdp_per_capita, freedom]
Index: []

In [23]:
len(merged_df)

0

In [25]:
happiness_df.head()

       country  happiness_rank  gdp_per_capita   freedom
0       Norway               1        1.616463  0.635423
1      Denmark               2        1.482383  0.626007
2      Iceland               3        1.480633  0.627163
3  Switzerland               4        1.564980  0.620071
4      Finland               5        1.443572  0.617951

In [26]:
store_directory_df.head()

   amount_of_stores               Country
0                 1               Andorra
1               144  United Arab Emirates
2               108             Argentina
3                18               Austria
4                22             Australia